{
    "symbol_vocab": {
        "<PAD>": 0,
        "<SOS>": 1,
        "<EOS>": 2,
        "<UNK>": 3,
        "!": 4,
        "(": 5,
        ")": 6,
        "+": 7,
        "-": 8,
        ".": 9,
        "/": 10,
        "0": 11,
        "1": 12,
        "2": 13,
        "3": 14,
        "4": 15,
        "5": 16,
        "6": 17,
        "7": 18,
        "8": 19,
        "9": 20,
        "=": 21,
        "A": 22,
        "B": 23,
        "C": 24,
        "COMMA": 25,
        "E": 26,
        "F": 27,
        "G": 28,
        "H": 29,
        "I": 30,
        "L": 31,
        "M": 32,
        "N": 33,
        "P": 34,
        "R": 35,
        "S": 36,
        "T": 37,
        "V": 38,
        "X": 39,
        "Y": 40,
        "[": 41,
        "\\Delta": 42,
        "\\alpha": 43,
        "\\beta": 44,
        "\\cos": 45,
        "\\div": 46,
        "\\exists": 47,
        "\\forall": 48,
        "\\gamma": 49,
        "\\geq": 50,
        "\\gt": 51,
        "\\in": 52,
        "\\infty": 53,
        "\\int": 54,
        "\\lambda": 55,
        "\\ldots": 56,
        "\\leq": 57,
        "\\lim": 58,
        "\\log": 59,
        "\\lt": 60,
        "\\mu": 61,
        "\\neq": 62,
        "\\phi": 63,
        "\\pi": 64,
        "\\pm": 65,
        "\\prime": 66,
        "\\rightarrow": 67,
        "\\sigma": 68,
        "\\sin": 69,
        "\\sqrt": 70,
        "\\sum": 71,
        "\\tan": 72,
        "\\theta": 73,
        "\\times": 74,
        "\\{": 75,
        "\\}": 76,
        "]": 77,
        "a": 78,
        "b": 79,
        "c": 80,
        "d": 81,
        "e": 82,
        "f": 83,
        "g": 84,
        "h": 85,
        "i": 86,
        "j": 87,
        "k": 88,
        "l": 89,
        "m": 90,
        "n": 91,
        "o": 92,
        "p": 93,
        "q": 94,
        "r": 95,
        "s": 96,
        "t": 97,
        "u": 98,
        "v": 99,
        "w": 100,
        "x": 101,
        "y": 102,
        "z": 103,
        "|": 104
    },
    "relation_vocab": {
        "<PAD>": 0,
        "-": 1,
        "Above": 2,
        "Below": 3,
        "Inside": 4,
        "Right": 5,
        "Sub": 6,
        "Sup": 7
    }
}