{
    "symbol_vocab": {
        "<PAD>": 0,
        "<EOS>": 1,
        "<UNK>": 2,
        "!": 3,
        "(": 4,
        ")": 5,
        "+": 6,
        "-": 7,
        ".": 8,
        "/": 9,
        "0": 10,
        "1": 11,
        "2": 12,
        "3": 13,
        "4": 14,
        "5": 15,
        "6": 16,
        "7": 17,
        "8": 18,
        "9": 19,
        "=": 20,
        "A": 21,
        "B": 22,
        "C": 23,
        "COMMA": 24,
        "E": 25,
        "F": 26,
        "G": 27,
        "H": 28,
        "I": 29,
        "L": 30,
        "M": 31,
        "N": 32,
        "P": 33,
        "R": 34,
        "S": 35,
        "T": 36,
        "V": 37,
        "X": 38,
        "Y": 39,
        "[": 40,
        "\\Delta": 41,
        "\\alpha": 42,
        "\\beta": 43,
        "\\cos": 44,
        "\\div": 45,
        "\\exists": 46,
        "\\forall": 47,
        "\\gamma": 48,
        "\\geq": 49,
        "\\gt": 50,
        "\\in": 51,
        "\\infty": 52,
        "\\int": 53,
        "\\lambda": 54,
        "\\ldots": 55,
        "\\leq": 56,
        "\\lim": 57,
        "\\log": 58,
        "\\lt": 59,
        "\\mu": 60,
        "\\neq": 61,
        "\\phi": 62,
        "\\pi": 63,
        "\\pm": 64,
        "\\prime": 65,
        "\\rightarrow": 66,
        "\\sigma": 67,
        "\\sin": 68,
        "\\sqrt": 69,
        "\\sum": 70,
        "\\tan": 71,
        "\\theta": 72,
        "\\times": 73,
        "\\{": 74,
        "\\}": 75,
        "]": 76,
        "a": 77,
        "b": 78,
        "c": 79,
        "d": 80,
        "e": 81,
        "f": 82,
        "g": 83,
        "h": 84,
        "i": 85,
        "j": 86,
        "k": 87,
        "l": 88,
        "m": 89,
        "n": 90,
        "o": 91,
        "p": 92,
        "q": 93,
        "r": 94,
        "s": 95,
        "t": 96,
        "u": 97,
        "v": 98,
        "w": 99,
        "x": 100,
        "y": 101,
        "z": 102,
        "|": 103
    },
    "relation_vocab": {
        "<PAD>": 0,
        "-": 1,
        "Above": 2,
        "Below": 3,
        "Inside": 4,
        "Right": 5,
        "Sub": 6,
        "Sup": 7
    }
}